#!/usr/bin/env python3
# -*- coding: utf-8 -*-

termins = [
    (1, 'algorithm complexity', 'сложносность алгоритма', 'алгоритм күрделілігі'),
    (1, 'execution time', 'время выполнения', 'орындалу уақыты'),
    (1, 'memory', 'память', 'жад'),
    (1, 'approximation theory', 'теория приближений', 'жуықтау теориясы'),
    (1, 'analysis', 'анализ', 'талдау'),
    (1, '', 'сравнительная оценка', 'салыстырмалы бағалау'),
    (1, '', 'трудоемкость алгоритма', 'алгоритмнің еңбек сыйымдылығы'),
    (1, 'merge sort', 'сортировка слиянием', 'бірігу сұрыптау'),
    (1, 'algorithm design', 'проектирование алгоритма', 'алгоритмді жобалау'),
    (1, 'dynamic programming', 'динамическое программирование', 'динамикалық бағдарламалау'),
    (1, 'greedy algorithm', 'жадный алгоритм', 'қомағай алгоритм'),
    (1, 'big O notation', 'нотация О большое', 'улкен О нотациясы'),
]
